app/views/users/show.html.erb

                 <div class="card-header">
                    <strong class="text-primary"><%= post.likes.any? ? "Liked by #{(render "names", likes: post.likes).truncate(50)}"  : "" %></strong>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."post_id" = ? LIMIT ?  [["post_id", 1], ["LIMIT", 1]]