app/views/home/index.html.erb

SELECT 1 AS one FROM "likes" WHERE "likes"."post_id" = ? LIMIT ?  [["post_id", 1], ["LIMIT", 1]]
---
        <div class="card-header">
          <strong class="text-primary"><%= post.likes.any? ? "Liked by #{(render "names", likes: post.likes).truncate(50)}"  : "" %></strong>