app/helpers/application_helper.rb

    def like_exist(post, current_user)
       like = Like.find_by(post_id: post.id, user_id: current_user.id)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]