app/controllers/posts_controller.rb

  def create

    @user = User.find(params[:user_id])
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hey"], ["user_id", 1], ["created_at", "2024-12-31 14:09:56.501433"], ["updated_at", "2024-12-31 14:09:56.501433"]]