app/controllers/users_controller.rb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."status" = ? AND (user_id = 1 OR friend_id = 1)  [["status", "accepted"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
  def show

    @accepted_friends = Friendship.where(status: 'accepted').where("user_id = :user_id OR friend_id = :user_id", user_id: current_user.id).map do |friendship|
      friendship.user_id == current_user.id ? friendship.friend : friendship.user
    end

    @friendship = Friendship.new
    @post = Post.new
    @user = User.find(params[:id])
    @user_posts = Post.where(user: @user).order(created_at: :desc)